#include "global.h"
#include "script.h"
#include "sound.h"
#include "ewram.h"
#include "utils.h"
#include "background.h"
#include "animation.h"
#include "court.h"
#include "case_data.h"
#include "investigation.h"
#include "graphics.h"
#include "constants/script.h"
#include "constants/songs.h"
#include "constants/process.h"
#include "constants/oam_allocations.h"

struct MapMarkerSprite
{
    /* +0x00 */ u8 *tiles;
    /* +0x04 */ u16 size;
    /* +0x06 */ u16 attr0;
    /* +0x08 */ u16 attr1;
    /* +0x0A */ u16 attr2;
};

struct SpotSelectData
{
    /* +0x00 */ struct Point4 firstArea;
    /* +0x10 */ struct Point4 secondArea;
    /* +0x20 */ u16 firstAreaSection;
    /* +0x22 */ u16 secondAreaSection;
    /* +0x24 */ u16 defaultSection;
    /* +0x26 */ u16 filler26; // Unused, called a dummy in unity
    /* +0x28 */ u8 left;
    /* +0x29 */ u8 top;
    /* +0x2A */ u8 right;
    /* +0x2B */ u8 bottom;
};

static const struct MapMarkerSprite sMapMarkerSprites[] = {
    {
        .tiles = gGfxMapMarkersKiller,
        .size = 0x80,
        .attr0 = 0x0000,
        .attr1 = 0x4000,
        .attr2 = 0x0000,
    },
    {
        .tiles = gGfxMapMarkersVictim,
        .size = 0x80,
        .attr0 = 0x0000,
        .attr1 = 0x4000,
        .attr2 = 0x0000,
    },
    {
        .tiles = gGfxMapMarkersCase2MiaBody,
        .size = 0x400,
        .attr0 = 0x8038,
        .attr1 = 0xC086,
        .attr2 = 0x0000,
    },
    {
        .tiles = gGfxMapMarkersCase2Thinker,
        .size = 0x0040,
        .attr0 = 0x8050,
        .attr1 = 0x00A0,
        .attr2 = 0x0000,
    },
    {
        .tiles = gGfxMapMarkersCase3Studio1,
        .size = 0x800,
        .attr0 = 0x0008,
        .attr1 = 0xC000,
        .attr2 = 0x0000,
    },
    {
        .tiles = gGfxMapMarkersCase3Studio2,
        .size = 0x800,
        .attr0 = 0x0050,
        .attr1 = 0xC048,
